Repository: 84000/data-translation-memory
Catalog: toh229-v4.tmx
Source language: bo
Languages: en

source: །དེ་དག་གིས་བསྐལ་པ་དཔག་ཏུ་མེད་གྲངས་མེད་པར་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་བསྒྲུབས་ནས་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་སྟེ། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀུན་ཏུ་འོད་ཅེས་བྱ་བར་འགྱུར་རོ།
en: Accomplishing unexcelled and perfect buddhahood after limitlessly and immeasurably many eons, they will fully awaken to buddhahood and all become known as the thus-gone, worthy, perfect Buddha Samantaprabha.

source: །བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པ་དེ་དག་གི་སངས་རྒྱས་ཀྱི་ཞིང་ཡང་ཀུན་ནས་སྣང་བ་དང་ལྡན་པར་འགྱུར་རོ།
en: The buddha fields of those fully awakened buddhas will become filled with light.

source: །དཔེར་ན་སུམ་ཅུ་རྩ་གསུམ་པའི་ལྷ་རྣམས་ཀྱི་བལྟ་ན་སྡུག་པ་རྟག་ཏུ་བརྒྱན་པ་དེ་བཞིན་དུ། དེ་དག་བྱང་ཆུབ་ཐོབ་པའི་འཇིག་རྟེན་གྱི་ཁམས་ཀྱང་རྟག་ཏུ་བརྒྱན་པར་འགྱུར་ཏེ།
en: Just as the gods of the Heaven of the Thirty-Three are always adorned with beautiful things, so will the worlds where these beings attain awakening always be adorned.

source: འཇམ་དཔལ་འཛུམ་པ་མཛད་པའི་རྒྱུ་ནི་དེ་ཡིན་ནོ།
en: Mañjuśrī, that is the cause for my smile.

source: །རྐྱེན་ནི་དེ་ཡིན་ནོ།
en: That is the reason. “

source: །འཇམ་དཔལ་འདི་ལྟ་སྟེ། དཔེར་ན་ཤར་ཕྱོགས་ལོགས་ན་དེ་བཞིན་གཤེགས་པ་ཤཱཀྱ་ཐུབ་པ་ཞེས་བྱ་བ་གྲངས་མེད་དཔག་ཏུ་མེད་པ་དག་ཀྱང་སངས་རྒྱས་ཀྱི་བགྲོ་བ་དང་། དེ་བཞིན་གཤེགས་པའི་བགྲོ་བ་དང་། ཆོས་ཀྱི་བགྲོ་བ་འདི་ཉིད་སྟོན་པར་མཛད་དོ། །
en: Mañjuśrī, it is like this: in the east, immeasurable, countless thus-gone ones named Śākyamuni teach this very discussion about buddhas, discussion about thus-gone ones, and discussion about the Dharma.

source: དེ་བཞིན་དུ་ལྷོ་ཕྱོགས་དང་། དེ་བཞིན་དུ་ནུབ་ཕྱོགས་དང་། དེ་བཞིན་དུ་བྱང་ཕྱོགས་དང་། དེ་བཞིན་དུ་འོག་གི་ཕྱོགས་དང་། དེ་བཞིན་དུ་སྟེང་གི་ཕྱོགས་དང་། དེ་བཞིན་དུ་ཕྱོགས་བཅུ་དག་ན་དེ་བཞིན་གཤེགས་པ་གྲངས་མེད་དཔག་ཏུ་མེད་པ་དག་ཀྱང་སངས་རྒྱས་ཀྱི་བགྲོ་བ་དང་། ཆོས་ཀྱི་བགྲོ་བ་དང་།
en: Likewise, in the south, west, and north, as well as below and above, in all the ten directions, immeasurable, countless thus-gone ones teach this very same discussion about buddhas, discussion about thus-gone ones, and discussion about the Dharma.

source: དེ་བཞིན་གཤེགས་པའི་བགྲོ་བ་འདི་ཉིད་སྟོན་པར་མཛད་དེ། ངས་ཡི་གེ་གང་གིས་བསྟན་པ་ཡི་གེ་དེ་ཉིད་ཀྱིས་དེ་བཞིན་གཤེགས་པ་དེ་དག་ཀྱང་སྟོན་པ་མཛད་དོ།
en: Whatever words I have used to teach, those thus-gone ones use the very same words. “

source: །འཇམ་དཔལ་འདས་པའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱིས་ཀྱང་སངས་རྒྱས་ཀྱི་བགྲོ་བ་དང་། དེ་བཞིན་གཤེགས་པའི་བགྲོ་བ་དང་། ཆོས་ཀྱི་བགྲོ་བ་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ནམ་མཁས་ཡོངས་སུ་ཟིན་པའི་ས་ཕྱོགས་འདི་ཉིད་དུ་ཡང་དག་པར་བསྒྲགས་སོ།
en: Mañjuśrī, in this very place within space, the blessed buddhas of the past also delivered this Dharma teaching of the discussions about buddhas, discussions about thus-gone ones, and discussions about the Dharma.

source: །འཇམ་དཔལ་མ་འོངས་པའི་དུས་ན་སངས་རྒྱས་བཅོམ་ལྡན་འདས་གང་དག་འབྱུང་བར་འགྱུར་བ་དེ་དག་ཀྱང་དེ་བཞིན་གཤེགས་པའི་བགྲོ་བ་དང་། སངས་རྒྱས་ཀྱི་བགྲོ་བ་དང་། ཆོས་ཀྱི་བགྲོ་བ་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ནམ་མཁས་ཡོངས་སུ་ཟིན་པའི་ས་ཕྱོགས་འདི་ཉིད་དུ་འཆད་པར་འགྱུར་རོ།
en: Mañjuśrī, in this very place within space, the blessed buddhas who will appear in the future will also explain this Dharma teaching on the discussions about buddhas, the discussions about thus-gone ones, and the discussions about the Dharma.

source: །འཇམ་དཔལ་དེ་བཞིན་གཤེགས་པ་བྱམས་པས་ཀྱང་སངས་རྒྱས་ཀྱི་བགྲོ་བ་དང་། དེ་བཞིན་གཤེགས་པའི་བགྲོ་བ་དང་། ཆོས་ཀྱི་བགྲོ་བ་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ནམ་མཁས་ཡོངས་སུ་ཟིན་པའི་ས་ཕྱོགས་འདི་ཉིད་དུ་ཡང་དག་པར་སྒྲོགས་པར་འགྱུར་རོ།
en: Mañjuśrī, in this very place within space, the thus-gone Maitreya will also deliver this Dharma teaching on the discussions about buddhas, discussions about thus-gone ones, and discussions about the Dharma.

source: །འཇམ་དཔལ་སངས་རྒྱས་ཀྱིས་གསུངས་པའོ་ཞེས་སྨྲ་བ་གང་ཡིན་པ་དེ་ནི་ཡང་དག་པར་སྨྲ་བ་སྟེ།
en: Mañjuśrī, spoken by the Buddha means truthful speech.

source: འཇམ་དཔལ་སངས་རྒྱས་ཀྱི་བགྲོ་བ་དང་། དེ་བཞིན་གཤེགས་པའི་བགྲོ་བ་དང་། ཆོས་ཀྱི་བགྲོ་བའི་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ནི་དེ་བཞིན་གཤེགས་པས་གསུངས་པའོ་ཞེས་སྨྲ་བ་གང་ཡིན་པ་དེ་ནི་ཡང་དག་པར་སྨྲ་བའོ།
en: Mañjuśrī, this Dharma teaching on the discussions about buddhas, discussions about thus-gone ones, and discussions about the Dharma is spoken by the Thus-Gone One, and so it is truthful speech. “

source: །འཇམ་དཔལ་གཞན་ཡང་ཤར་ཕྱོགས་ལོགས་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཡན་ལག་མཆོག་ཅེས་བྱ་བ་དེས་ང་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །དེ་བཞིན་གཤེགས་པ་ཤཱཀྱའི་རྒྱལ་པོའི་མཆོག་ཤཱཀྱ་ཐུབ་པས་གང་ལ་གནས་ཏེ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས།
en: Moreover, Mañjuśrī, in the east, the thus-gone, worthy, perfect Buddha Varāṅga asked me, ‘On what basis did the Thus-Gone One, the greatest of the Śākya kings, Śākyamuni, fully awaken to unexcelled and perfect buddhahood?’

source: དེ་སྐད་ཅེས་སྨྲས་པ་དང་། དེ་ལ་ངས་འདི་སྐད་ཅེས་སྨྲས་སོ། །སྒྱུ་མའི་སྐྱེས་བུ་རྣམ་པར་ཐར་པ་བརྒྱད་མངོན་པར་བསྒྲུབ་པ་གང་ལ་གནས་པ་དེ་ལ་གནས་ཏེ་ཁོ་བོ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་སོ།
en: I replied, ‘I fully awakened to unexcelled and perfect buddhahood on the basis from which illusory beings accomplish the eight liberations.’

source: །འཇམ་དཔལ་གཞན་ཡང་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཡན་ལག་མཆོག་ཅེས་བྱ་བ་དེ་ལ་ངས་འདི་སྐད་ཅེས་སྨྲས་སོ། །དེ་བཞིན་གཤེགས་པ་ཡན་ལག་མཆོག་གིས་གང་ལ་གནས་ཏེ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས།
en: Mañjuśrī, I then asked the thus-gone, worthy, perfect Buddha Varāṅga, ‘On what basis did the thus-gone Varāṅga fully awaken to unexcelled and perfect buddhahood?’

source: དེ་སྐད་ཅེས་སྨྲས་པ་དང་། དེས་ང་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །དེ་བཞིན་གཤེགས་པ་ཤཱཀྱ་ཐུབ་པས་གང་ལ་གནས་ཏེ་ཕུང་པོ་ལྷག་མ་མེད་པའི་མྱ་ངན་ལས་འདས་པའི་དབྱིངས་སུ་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བར་འགྱུར།
en: The Thus-Gone One replied to me, ‘On what basis will the thus-gone Śākyamuni pass away into the expanse of nirvāṇa in which the aggregates do not remain?’ ”

source: དེ་ནས་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་གང་ལ་གནས་ཏེ་ཕུང་པོ་ལྷག་མ་མ་མཆིས་པའི་མྱ་ངན་ལས་འདས་པའི་དབྱིངས་སུ་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བར་འགྱུར་ལགས།
en: Youthful Mañjuśrī now asked, “Blessed One, on what basis will you pass away into the expanse of nirvāṇa in which the aggregates do not remain?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། འཇམ་དཔལ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ནི་བསམ་གྱིས་མི་ཁྱབ་པའི་མཐའི་ཡུལ་ལ་གནས་ཏེ་ཡོངས་སུ་མྱ་ངན་ལས་འདའོ།
en: The Blessed One replied, “Mañjuśrī, the blessed buddhas pass away on the basis of the domain of the inconceivable limit.

source: །འཇམ་དཔལ་ཆོས་ཐམས་ཅད་ནི་དེ་ལྟ་བུ་ལ་གནས་པ་སྟེ།
en: Mañjuśrī, all phenomena have a basis like that.

source: །འཇམ་དཔལ་གཞན་ཡང་ཤར་ཕྱོགས་ལོགས་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀུན་ཏུ་གཟིགས་ཞེས་བྱ་བ་དེས་ང་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །དེ་བཞིན་གཤེགས་པ་ཤཱཀྱའི་རྒྱལ་པོའི་མཆོག་ཤཱཀྱ་ཐུབ་པས་གང་ལ་གནས་ཏེ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས།
en: Moreover, Mañjuśrī, in the east, the thus-gone, worthy, perfect Buddha All-Seeing asked me, ‘On what basis did the Thus-Gone One, the greatest of the Śākya kings, Śākyamuni, fully awaken to unexcelled and perfect buddhahood?’

source: དེ་སྐད་ཅེས་སྨྲས་པ་དང་། དེ་ལ་ངས་འདི་སྐད་ཅེས་སྨྲས་སོ། །དེ་སངས་རྒྱས་ཀྱི་སྤྲུལ་པ་གང་ལ་གནས་པ་དེ་ལ་གནས་ཏེ། ཁོ་བོ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་སོ།
en: I replied, ‘I fully awakened to unexcelled and perfect buddhahood on the basis of the emanation of a buddha.’

source: །འཇམ་དཔལ་གཞན་ཡང་དེ་བཞིན་གཤེགས་པ་ཀུན་ཏུ་གཟིགས་ཞེས་བྱ་བ་དེ་ལ་ངས་འདི་སྐད་ཅེས་སྨྲས་སོ། །དེ་བཞིན་གཤེགས་པ་ཀུན་ཏུ་གཟིགས་ཀྱིས་གང་ལ་གནས་ཏེ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས།
en: Mañjuśrī, I then asked the thus-gone All-Seeing, ‘On what basis did the thus-gone All-Seeing fully awaken to unexcelled and perfect buddhahood?’

source: དེ་སྐད་ཅེས་སྨྲས་པ་དང་། དེས་ང་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །མཐའ་གང་ཁོ་ན་ལ་གནས་ནས་ཁོ་བོ་ལ་འདྲི་བ་དེ་ལ་གནས་ཏེ་ཁོ་བོ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ཏེ།
en: The Thus-Gone One replied, ‘I fully awakened to unexcelled and perfect buddhahood on the very same limit that forms the basis from which you are posing that question to me.’

source: །འཇམ་དཔལ་གཞན་ཡང་ཤར་ཕྱོགས་ལོགས་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ནམ་མཁའ་རྣམ་དག་མངོན་འཕགས་དཔལ་གྱི་རྒྱལ་པོ་ཞེས་བྱ་བ་དེས་ང་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཤཱཀྱའི་རྒྱལ་པོའི་གཙོ་བོ་ཤཱཀྱ་ཐུབ་པས་གང་ལ་གནས་ཏེ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས།
en: Moreover, Mañjuśrī, in the east, the thus-gone, worthy, perfect Buddha Exalted Noble Lord of the Pure Sky asked me, ‘On what basis did the Thus-Gone One, the greatest of the Śākya kings, Śākyamuni, fully awaken to unexcelled and perfect buddhahood?’

source: དེ་སྐད་ཅེས་སྨྲས་པ་དང་། ངས་དེ་བཞིན་གཤེགས་པ་དེ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །བྱིས་པ་སོ་སོའི་སྐྱེ་བོའི་ཆོས་རྣམས་གང་ལ་གནས་པ་དེ་ལ་གནས་ཏེ་ཁོ་བོ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་སོ།
en: I replied to the Thus-Gone One, ‘I fully awakened to unexcelled and perfect buddhahood on the same basis on which the phenomena of childish, ordinary beings are based.’

source: །འཇམ་དཔལ་གྱིས་གསོལ་པ། བཅོམ་ལྡན་འདས་བྱིས་པ་སོ་སོའི་སྐྱེ་བོའི་ཆོས་རྣམས་གང་ལ་གནས་ལགས། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: ” Mañjuśrī asked, “Blessed One, what is the basis for the phenomena of childish, ordinary beings?” “

source: འཇམ་དཔལ་ཁྱོད་ཀྱིས་བྱིས་པ་སོ་སོའི་སྐྱེ་བོའི་ཆོས་རྣམས་ཡང་དག་པར་རྗེས་སུ་མཐོང་ངམ།
en: Mañjuśrī,” replied the Blessed One, “do you consider the phenomena of childish, ordinary beings to be existent?” “

source: འཇམ་དཔལ་གྱིས་གསོལ་པ། བཅོམ་ལྡན་འདས་དེ་ནི་མ་ལགས་སོ།
en: No, Blessed One,” said Mañjuśrī. “

source: བཅོམ་ལྡན་འདས་བྱིས་པ་སོ་སོའི་སྐྱེ་བོའི་ཆོས་རྣམས་ནི་ཕྱི་དང་ནང་ན་མི་དམིགས་ལགས་སོ།
en: Blessed One, it is because the phenomena of childish, ordinary beings cannot be observed either inside or outside.”

source: །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། འཇམ་དཔལ་འདི་ལྟར་ཕྱི་དང་ནང་ལ་མི་གནས་པར་ངས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་སོ།
en: The Blessed One said, “Just like that, Mañjuśrī, I fully awakened to unexcelled and perfect buddhahood without dwelling either inside or outside. “

source: །འཇམ་དཔལ་གཞན་ཡང་དེ་བཞིན་གཤེགས་པ་དེ་ལ་ངས་འདི་སྐད་ཅེས་སྨྲས་སོ། །དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ནམ་མཁའ་རྣམ་དག་མངོན་འཕགས་དཔལ་གྱི་རྒྱལ་པོས་གང་ལ་གནས་ཏེ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས།
en: Moreover, Mañjuśrī, I asked the Thus-Gone One, ‘Thus-gone, worthy, perfect Buddha Exalted Noble Lord of the Pure Sky, on what basis did you fully awaken to unexcelled and perfect buddhahood?’

source: དེ་སྐད་ཅེས་སྨྲས་པ་དང་། དེས་ང་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །སྒྱུ་མའི་སྐྱེས་བུ་རྣམ་པར་ཐར་པ་བརྒྱད་མངོན་པར་སྒྲུབ་པ་གང་ལ་གནས་པ་དེ་ལ་གནས་ཏེ་ཁོ་བོ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་སོ།
en: The Thus-Gone One replied, ‘I fully awakened to unexcelled and perfect buddhahood on the basis from which illusory beings accomplish the eight liberations.’

source: །དེ་སྐད་ཅེས་སྨྲས་པ་དང་། འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་འདི་ལྟར་སྒྱུ་མའི་སྐྱེས་བུ་ཉིད་མ་མཆིས་ཤིང་མི་དམིགས་པ་ལགས་ན། དེའི་རྣམ་པར་ཐར་པ་བརྒྱད་ཀྱི་སྒོ་མངོན་པར་སྒྲུབ་པ་ལྟ་ག་ལ་མཆིས།
en: ” Youthful Mañjuśrī then asked the Blessed One, “Blessed One, if illusory beings do not exist and cannot be observed, how could they actually accomplish the gateways of the eight liberations?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། འཇམ་དཔལ་འདི་ཇི་སྙམ་དུ་སེམས། ཆོས་གང་མེད་ཅིང་མི་དམིགས་པ་དེ་སྒྱུ་མའི་སྐྱེས་བུ་ཡིན་ནམ།
en: The Blessed One replied, “Tell me, Mañjuśrī—are those phenomena, which do not exist and cannot be observed, illusory beings?”

source: །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། འཇམ་དཔལ་འདི་ཇི་སྙམ་དུ་སེམས་ཅི་སྒྱུ་མའི་སྐྱེས་བུ་ཡོད་དམ།
en: Tell me, Mañjuśrī,” said the Blessed One. “Do illusory beings exist?”

source: །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། འཇམ་དཔལ་དེ་བཞིན་དུ་རྣམ་པར་ཐར་པ་བརྒྱད་པོ་དེ་ལྟ་བུ་ལ་གནས་ཏེ་ང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ཏེ། དེ་ནི་ཡིད་ཀྱི་ཡང་དག་པར་བགྲོ་བའི་དྲི་བའོ།
en: The Blessed One said, “Likewise, Mañjuśrī, I fully awakened to unexcelled and perfect buddhahood on the basis of the eight liberations, which are just like that. Such were the questions in the discussion we had by means of the mind. “

source: །འཇམ་དཔལ་གཞན་ཡང་ཤར་ཕྱོགས་ལོགས་ན་དེ་བཞིན་གཤེགས་པ་འོད་ཀྱི་དཀྱིལ་འཁོར་མངོན་པར་འཕགས་པའི་མེ་ཏོག་དཔལ་གྱི་གཟི་བརྗིད་རྒྱལ་པོ་ཞེས་བྱ་བ་དེ་ལ་ངས་འདི་སྐད་ཅེས་སྨྲས་སོ། །དེ་བཞིན་གཤེགས་པ་འོད་ཀྱི་དཀྱིལ་འཁོར་མངོན་པར་འཕགས་པའི་མེ་ཏོག་དཔལ་གྱི་གཟི་བརྗིད་རྒྱལ་པོས་གང་ལ་གནས་ཏེ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས།
en: Moreover, Mañjuśrī, in the east, I asked the thus-gone Splendorous King of the Glorious Exalted Flower-Garland Corona, ‘Thus-gone Splendorous King of the Glorious Exalted Flower-Garland Corona, on what basis did you fully awaken to unexcelled and perfect buddhahood?’

source: དེ་སྐད་ཅེས་སྨྲས་པ་དང་། དེས་ང་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །གཟུགས་དང་། ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་རྣམས་གང་ལ་གནས་པ་དང་། རྣམ་པར་ཤེས་པ་གང་ལ་གནས་པ་དེ་ལ་གནས་ཏེ་ཁོ་བོ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་སོ།
en: The Thus-Gone One replied, ‘I fully awakened to unexcelled and perfect buddhahood on the basis of form, feeling, perception, and formation, and also on the basis of consciousness.’ ”

source: །འཇམ་དཔལ་གྱིས་གསོལ་པ། བཅོམ་ལྡན་འདས་གཟུགས་དང་། ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་རྣམས་དང་། རྣམ་པར་ཤེས་པ་དག་གང་ན་གནས་ལགས།
en: Mañjuśrī asked, “Blessed One, what is the basis of form, feeling, perception, formation, and consciousness?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། འཇམ་དཔལ་འདི་ཇི་སྙམ་དུ་སེམས། ཕུང་པོ་ལྔ་མ་གཏོགས་པར་ཕུང་པོ་ལྔ་གང་ལ་གནས་པའི་ཆོས་འགའ་ཞིག་འདི་ན་ཡོད་དམ།
en: The Blessed One replied, “Tell me, Mañjuśrī—besides the five aggregates, are there some phenomena that are the basis for the aggregates?” “

source: །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། འཇམ་དཔལ་འདི་ཇི་སྙམ་དུ་སེམས། གཟུགས་ཀྱི་ངོ་བོ་ཉིད་གང་ཡིན་པ་དེ་གཟུགས་ལ་གནས་པ་ཡིན་ནམ།
en: The Blessed One asked, “Tell me, Mañjuśrī—does the essence of form abide in form?” “

source: འཇམ་དཔལ་གྱིས་གསོལ་པ། བཅོམ་ལྡན་འདས་དེ་ནི་མ་ལགས་སོ། །
en: Blessed One, it does not,” replied Mañjuśrī.

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། འཇམ་དཔལ་འདི་ཇི་སྙམ་དུ་སེམས། ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་རྣམས་གང་དག་ཡིན་པ་དང་། རྣམ་པར་ཤེས་པའི་ངོ་བོ་ཉིད་གང་ཡིན་པ་དེ་རྣམ་པར་ཤེས་པ་ལ་གནས་པ་ཡིན་ནམ།
en: The Blessed One asked, “Tell me, Mañjuśrī—is the essence of feeling, perception, formation, and consciousness the same as feeling, perception, formation, and consciousness?” “

source: གསོལ་པ། དེ་ནི་མ་ལགས་སོ། །
en: Blessed One, it is not,” replied Mañjuśrī.

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། འཇམ་དཔལ་འདི་ཇི་སྙམ་དུ་སེམས། གཟུགས་དང་། ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་རྣམས་དང་། རྣམ་པར་ཤེས་པ་མི་གནས་པ་ཡིན་ནམ།
en: The Blessed One asked, “Tell me, Mañjuśrī—are form, feeling, perception, formation, and consciousness without any basis?” “

source: འཇམ་དཔལ་གྱིས་གསོལ་པ། བཅོམ་ལྡན་འདས་དེ་ལྟ་ལགས་ཏེ།
en: Blessed One, it is so,” replied Mañjuśrī. “

source: བཅོམ་ལྡན་འདས་གཟུགས་དང་། ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་རྣམས་དང་། རྣམ་པར་ཤེས་པ་ནི་མི་གནས་པ་ལགས་སོ།
en: Blessed One, form, feeling, perception, formation, and consciousness have no basis.”

source: །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། འཇམ་དཔལ་དེ་བཞིན་དུ་རྣམ་པར་རིག་པའི་ངོ་བོ་ཉིད་གང་ཡིན་པ་དེ་ནི་རྣམ་པར་རིག་པ་མེད་པ་ཡིན་ལ།
en: The Blessed One said, “In the same way, Mañjuśrī, the essence of perceiving is the absence of perceiving.

source: རྣམ་པར་རིག་པ་མེད་པ་གང་ཡིན་པ་དེ་ནི་བྱང་ཆུབ་སྟེ། ེ
en: The absence of perceiving is awakening.

source: །འཇམ་དཔལ་གཞན་ཡང་དེ་བཞིན་གཤེགས་པ་འོད་ཀྱི་དཀྱིལ་འཁོར་མངོན་པར་འཕགས་པའི་མེ་ཏོག་དཔལ་གྱི་གཟི་བརྗིད་རྒྱལ་པོ་དེས་ང་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །དེ་བཞིན་གཤེགས་པ་ཤཱཀྱའི་རྒྱལ་པོའི་གཙོ་བོ་ཤཱཀྱ་ཐུབ་པས་གང་ལ་གནས་ཏེ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས།
en: Mañjuśrī, the thus-gone Splendorous King of the Glorious Exalted Flower-Garland Corona asked me, ‘On what basis did the Thus-Gone One, the greatest of the Śākya kings, Śākyamuni, fully awaken to unexcelled and perfect buddhahood?’

source: དེ་སྐད་ཅེས་སྨྲས་པ་དང་། དེ་ལ་ངས་འདི་སྐད་ཅེས་སྨྲས་སོ། །ཆོས་ཐམས་ཅད་ཟད་པ་མེད་པ། ནམ་མཁའི་མཐའ་དང་མཉམ་པ་དེ་ནི་བྱང་ཆུབ་སྟེ།
en: I replied, ‘All phenomena—inexhaustible and vast as space—are awakening.

source: །ཆོས་ཐམས་ཅད་ནི་དེ་ལྟ་བུ་ལ་གནས་པ་སྟེ།
en: All phenomena have such a basis.’

source: །བསྟན་པ་འདི་བཤད་པ་ན་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདི་རྣམ་པ་དྲུག་ཏུ་རབ་ཏུ་གཡོས་སོ། །འགུལ་ཏོ། །ལྡེག་གོ། །འཁྲུགས་སོ། །འུར་འུར་རོ། །ཆེམ་ཆེམ་མོ། །
en: When this teaching was given, all the worlds in the great trichiliocosm moved in six ways: they shook, trembled, rocked, quaked, vibrated, and rumbled.

source: ཐམས་ཅད་དང་ལྡན་པའི་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་སྣང་བ་ཆེན་པོས་ཁྱབ་པར་གྱུར་ཏོ།
en: The entire great trichiliocosm became suffused with bright light.

source: །འཇིག་རྟེན་གྱི་བར་མུན་པ་མུན་ནག་གང་ན་ཉི་མ་དང་ཟླ་བ་འདི་གཉིས་འདི་ལྟར་རྫུ་འཕྲུལ་ཆེ་བ། འདི་ལྟར་མཐུ་ཆེ་བ། འདི་ལྟར་གཟ་བརྗིད་ཆེ་བའི་འོད་ཀྱིས་སྣང་བར་མ་ནུས་པ་དང་། གཟི་བརྗིད་ཀྱིས་གཟི་བྱིན་ཅན་དུ་མ་ནུས་པ་དང་། སྣང་བས་སྣང་བར་མ་ནུས་པ་དང་། གསལ་བས་གསལ་ཞིང་སྣང་བར་མ་ནུས་པ་གང་དག་ཡིན་པ་འཇིག་རྟེན་གྱི་བར་དེ་དག་ཐམས་ཅད་སྐད་ཅིག་དེ་ཉིད་དང་། ཐང་ཅིག་དེ་ཉིད་དང་། ཡུད་ཙམ་དེ་ཉིད་ལ་སྣང་བས་ཁྱབ་པར་གྱུར་ཏོ། །
en: At that time, at that moment, in that very instant, even the pitch-black intermediate spaces between worlds, where the wondrous, powerful, brilliant light of the sun and the moon does not shine, where their brilliance, illumination, and luminosity cannot reach and spread light—even those places became suffused with light.

source: དེ་ནས་དེའི་ཚེ་བཅོམ་ལྡན་འདས་འཛུམ་པ་མཛད་དེ། འདི་ནི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་གང་གི་ཚེ་འཛུམ་པ་མཛད་པའི་ཆོས་ཉིད་དེ། དེའི་ཚེ་བཅོམ་ལྡན་འདས་ཀྱི་ཞལ་གྱི་སྒོ་ནས་འོད་ཟེར་ཁ་དོག་སྣ་ཚོགས་ཁ་དོག་དུ་མ་འདི་ལྟ་སྟེ། སྔོན་པོ་དང་། སེར་པོ་དང་། དམར་པོ་དང་། དཀར་པོ་དང་། བཙོད་ཀ་དང་། ཤེལ་དང་། དངུལ་གྱི་ཁ་དོག་ལྟ་བུ་དག་བྱུང་ནས། དེ་དག་གིས་འཇིག་རྟེན་གྱི་ཁམས་མཐའ་ཡས་མུ་མེད་པ་དག་འོད་ཀྱིས་ཁྱབ་པར་བྱས་ཏེ།
en: Then the Blessed One smiled, and as is the case whenever blessed buddhas smile, a variegated array of blue, yellow, red, white, crimson, crystal, and silver-colored rays of light emanated from his mouth and filled infinite, limitless world systems with light.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་དེའི་ཚེ་གཡས་ཕྱོགས་ལོགས་སུ་གླང་པོ་ཆེའི་ལྟ་སྟངས་ཀྱིས་གཟིགས་ནས། ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་ལ་བཀའ་སྩལ་པ། ཀུན་དགའ་བོ་འཁོར་འདི་ནི་དག་པ་སྟེ། གཙང་བ་སྙིང་པོ་ལ་གནས་པའོ།
en: The Blessed One now turned to his right, looked with his elephant gaze, and made this prophecy to venerable Ānanda, “Ānanda, this assembly is immaculate; it is pure to the core.

source: །ཀུན་དགའ་བོ་བསྟན་པ་འདི་བཤད་པ་ན་དགེ་སློང་ལྔ་བརྒྱ་ནི་ལེན་པ་མེད་པར་ཟག་པ་རྣམས་ལས་སེམས་རྣམ་པར་གྲོལ་ལོ།
en: Ānanda, when this teaching was given, the minds of five hundred monks were freed from defilement without any further appropriation.

source: །ཀུན་དགའ་བོ་རྒྱལ་བུ་རྒྱལ་བྱེད་ཀྱི་ཚལ་འདི་ན་དགེ་སློང་ཇི་སྙེད་ཅིག་གནས་པ་ཀུན་དགའ་བོ་དེ་དག་གི་ནང་ནས་ཆོས་འདི་དག་ལ་གང་ཐེ་ཙོམ་ཟ་བ་འམ། ཡིད་གཉིས་ཟ་བའམ། སོམ་ཉི་ཟ་བའི་དགེ་སློང་འགའ་ཡང་མ་བྱུང་ངོ་།
en: Ānanda, among all the monks who abide here in the Jeta Grove, there is not a single one who harbors any doubt, uncertainty, or worry with regard to these teachings.

source: །བྱང་ཆུབ་སེམས་དཔའ་ལྔ་སྟོང་གིས་མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་ཐོབ་པར་གྱུར་ཏོ།
en: Five thousand bodhisattvas gained certainty in the unborn nature of phenomena.

source: །སྲོག་ཆགས་སྟོང་ཕྲག་དུ་མས་ནི་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་དེ། དེ་དག་ཐམས་ཅད་ཀྱང་མ་འོངས་པའི་དུས་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀུན་དུ་བརྗོད་ཅེས་བྱ་བར་མིང་འཐུན་པ་ཉིད་དུ་འགྱུར་རོ་ཞེས་བཅོམ་ལྡན་འདས་ཀྱིས་ལུང་བསྟན་ཏོ།
en: Many thousands of beings developed the resolve to attain unexcelled and perfect buddhahood, and in the future all of them will come to share the same name: the thus-gone, worthy, perfect Buddha Universal Proclamation.

source: །དེ་དག་གི་ཚེའི་ཚད་ནི་བསྐལ་པ་གཅིག་ཐུབ་པར་འགྱུར་རོ། །དེ་དག་གི་དམ་པའི་ཆོས་ནི་བསྐལ་པ་ཕྱེད་ཀྱི་བར་དུ་གནས་པར་འགྱུར་རོ།
en: Their lives will last for an entire eon, and their sacred Dharma will persist for half an eon thereafter.

source: །དེ་ནས་ཡུལ་ཀོ་ས་ལའི་རྒྱལ་པོ་གསལ་རྒྱལ་འདི་སྙམ་དུ་སེམས་པར་གྱུར་ཏོ། །བདག་གིས་ནི་བཅོམ་ལྡན་འདས་ཡུན་རིང་ཞིག་ཏུ་མ་མཐོང་བས། བདག་གིས་བཅོམ་ལྡན་འདས་ལ་ཕྱག་བྱ་བ་དང་། བལྟ་བ་དང་། བསྙེན་བཀུར་བྱ་བའི་ཕྱིར། བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་འགྲོ་བར་བྱའོ་སྙམ་མོ། །
en: At that time, King Prasenajit of Kośala had the thought, “I have gone a long time without seeing the Thus-Gone One, so I must go to where he resides so that I can honor him, meet him, and serve him.”

source: དེ་ནས་ཡུལ་ཀོ་ས་ལའི་རྒྱལ་པོ་གསལ་རྒྱལ་གྱིས་དེའི་ཚེ་སྣ་ཆེན་པོ་ལ་གཏོགས་པ་དབྱིབས་རིང་ལ་སྨྲས་པ། བཅོམ་ལྡན་འདས་ལ་ཕྱག་བྱ་བ་དང་། བལྟ་བ་དང་། བསྙེན་བཀུར་བྱ་བའི་ཕྱིར་འདོང་དགོས་ཀྱིས་ངའི་ཤིང་རྟ་བཞོན་པ་བཟང་པོ་དང་ལྡན་པ་ཐོག་མར་སྦྱོར་ཅིག །
en: King Prasenajit of Kośala said to his minister Long Shape, “I wish to honor, meet, and serve the Blessed One, so go right away and prepare my carriage with the finest horses.”

source: ཡང་ཡུལ་ཀོ་ས་ལའི་རྒྱལ་པོ་གསལ་རྒྱལ་གྱིས་དེའི་ཚེ་སྣ་ཆེན་པོ་ལ་གཏོགས་པ་དཔལ་མཆོག་ལ་སྨྲས་པ། བཅོམ་ལྡན་འདས་ལ་ཕྱག་བྱ་བ་དང་། བལྟ་བ་དང་། བསྙེན་བཀུར་བྱ་བའི་ཕྱིར་འདོང་དགོས་ཀྱིས། དཔལ་མཆོག་ཁྱོད་སོང་ལ་ཡན་ལག་བཞི་པའི་དཔུང་གི་ཚོགས་དག་ཤོམས་ཤིག་ཅེས་བསྒོ་ཤིག །
en: King Prasenajit of Kośala then said to his minister Great Glory, “I wish to honor, meet, and serve the Blessed One. Therefore, Great Glory, go and prepare an army of the four kinds of troops.”

source: ཡང་ཡུལ་ཀོ་ས་ལའི་རྒྱལ་པོ་གསལ་རྒྱལ་གྱིས་བཙུན་མོ་དམ་པ་ལ་སྨྲས་པ། བཅོམ་ལྡན་འདས་ལ་ཕྱག་བྱ་བ་དང་། བལྟ་བ་དང་། བསྙེན་བཀུར་བྱ་བའི་ཕྱིར་ཁྱོད་ཀྱང་འདོང་ངོ་ཞེས་སྨྲས་སོ།
en: King Prasenajit of Kośala then said to his chief queen, “You must also come to honor, meet, and serve the Blessed One.”

source: །ཡང་ཡུལ་ཀོ་ས་ལའི་རྒྱལ་པོ་གསལ་རྒྱལ་གྱིས་གཞོན་ནུ་ས་གས་བྱིན་ལ་སྨྲས་པ། གཞོན་ནུ་ས་གས་བྱིན་ཁྱོད་སོང་ལ་རི་དགས་འཛིན་གྱི་མ་ལ་རྒྱལ་པོ་གསལ་རྒྱལ་ན་རེ་བཅོམ་ལྡན་འདས་ལ་ཕྱག་བྱ་བ་དང་། བལྟ་བ་དང་། བསྙེན་བཀུར་བྱ་བའི་ཕྱིར་འདོང་དགོས་སོ་ཞེས་སྦྲོན་ཅིག །
en: King Prasenajit of Kośala then said to the prince Given-by-Viśākhā, “Prince Given-by-Viśākhā, go tell Mṛgāramātā that King Prasenajit wishes to go to honor, meet, and serve the Blessed One.”

source: དེ་ནས་ཡུལ་ཀོ་ས་ལའི་རྒྱལ་པོ་གསལ་རྒྱལ་གྱིས་སྣ་ཆེན་པོ་ལ་གཏོགས་པ་རྩིས་པ་ས་ག་བཟང་པོ་ལ་སྨྲས་པ། ས་ག་བཟང་པོ་ཁྱོད་སོང་ལ་གྲོང་ཁྱེར་ཆེན་པོ་མཉན་ཡོད་ཀྱི་མི་དེ་དག་ཐམས་ཅད་ཀྱང་ཆར་གཞུག་ཅིང་།
en: King Prasenajit of Kośala then said to his court astrologer Suviśākha, “Suviśākha, go and gather together all the inhabitants of the city of Śrāvastī.

source: ལྗོངས་ཀྱི་མི་དང་། གྲོང་རྡལ་བའི་མི་ཐམས་ཅད་ལ་ཡང་རྐང་ཏང་པས་ཀྱང་རྐང་ཏང་པ་དང་། བཞི་མདོ་བས་ཀྱང་བཞི་མདོ་བ་དང་། སུམ་མདོ་བས་ཀྱང་སུམ་མདོ་བ་དང་། ཤིང་རྟ་པས་ཀྱང་ཤིང་རྟ་པ་ལ་ཡུལ་ཀོ་ས་ལའི་རྒྱལ་པོ་གསལ་རྒྱལ་ན་རེ། བཅོམ་ལྡན་འདས་ལ་ཕྱག་བྱ་བ་དང་། བལྟ་བ་དང་། བསྙེན་བཀུར་བྱ་བའི་ཕྱིར་འདོང་དགོས་ཀྱི་ཆ་རྫས་གྱིས་ཤིག་ཅེས་སྦྲོན་ཅིག །
en: Summon everyone from the kingdom and the surroundings: those who travel by foot, those who come via the four-way crossroads and via the three-way crossroads, and those who travel by carriage. Tell them all that King Prasenajit of Kośala commands that they go to honor, meet, and serve the Blessed One.

source: སྣ་ཆེན་པོ་ལ་གཏོགས་པ་ཐམས་ཅད་ལ་ཡང་སྦྲོན་ཅིག །ཁྱིམ་བདག་མགོན་མེད་ཟས་སྦྱིན་ལ་ཡང་སྦྲོན་ཅིག །ཁྱིམ་བདག་དེད་དཔོན་བཟང་པོ་ལ་ཡང་སྦྲོན་ཅིག །ཁྱིམ་བདག་ས་ག་ལ་ཡང་སྦྲོན་ཅིག །ཁྱིམ་བདག་ཀླུ་དགའ་ལ་ཡང་སྦྲོན་ཅིག །
en: You must also summon all the ministers, the householder Anāthapiṇḍada, the householder Susārthavāha, the householder Viśākha, and the householder Friend of the Nāgas.

source: ཚོང་པ་དང་། ཁྱིམ་བདག་ཐམས་ཅད་ལ་ཡང་སྦྲོན་ཅིག །
en: Also summon all the merchants and householders.

source: ཁྱིམ་བདག་བསོད་ནམས་དཔལ་བྱུང་ལ་ཡང་སྦྲོན་ཅིག །ཁྱིམ་བདག་བསོད་ནམས་དཔལ་ལ་ཡང་སྦྲོན་ཅིག །ཁྱིམ་བདག་བསོད་ནམས་དཔལ་གྱི་སྙིང་པོ་དང་།
en: Summon the householders Arisen Great Merit, Great Merit, and Heart of Great Merit.

source: གཅེས་མིན་གྱིས་བྱིན་དང་། རི་དགས་འཛིན་དང་། འཕེལ་བྱེད་དང་། ས་གསོ་བྱིན་རྣམས་ལ་ཡང་སྦྲོན་ཅིག །
en: Also, summon Unrestrained Generosity, Mṛgāra, Increaser, and Given-by-Viśākhā.
